places/app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
    @places = Place.all

INSERT INTO "places" ("name", "latitude", "longitude", "notes", "hashtags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save

DELETE FROM "places" WHERE "places"."id" = ?  [["id", 1]]
---
  def destroy
    @place.destroy

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_place
      @place = Place.find(params[:id])